In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'company':['GOOG','GOOG','MFST','MFST','FB','FB'],'person':['karim','Rahim','Jodu','Modu','Sam','Curran'],
     'sales':[200,120,300,100,190,400]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

  company  person  sales
0    GOOG   karim    200
1    GOOG   Rahim    120
2    MFST    Jodu    300
3    MFST    Modu    100
4      FB     Sam    190
5      FB  Curran    400

In [5]:
bycomp=df.groupby('company')

In [7]:
bycomp.mean()

         sales
company
FB       295.0
GOOG     160.0
MFST     200.0

In [8]:
bycomp.sum()

         sales
company
FB         590
GOOG       320
MFST       400

In [9]:
bycomp.std()

              sales
company
FB       148.492424
GOOG      56.568542
MFST     141.421356

In [10]:
bycomp.sum().loc['FB']

sales    590
Name: FB, dtype: int64

In [11]:
df.groupby('company').sum().loc['GOOG']

sales    320
Name: GOOG, dtype: int64

In [12]:
df.groupby('company').count()

         person  sales
company
FB            2      2
GOOG          2      2
MFST          2      2

In [13]:
df.groupby('company').max()

        person  sales
company
FB         Sam    400
GOOG     karim    200
MFST      Modu    300

In [14]:
df.groupby('company').describe()

        sales
        count   mean         std    min    25%    50%    75%    max
company
FB        2.0  295.0  148.492424  190.0  242.5  295.0  347.5  400.0
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MFST      2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0

In [15]:
df.groupby('company').describe().transpose()

company              FB        GOOG        MFST
sales count    2.000000    2.000000    2.000000
      mean   295.000000  160.000000  200.000000
      std    148.492424   56.568542  141.421356
      min    190.000000  120.000000  100.000000
      25%    242.500000  140.000000  150.000000
      50%    295.000000  160.000000  200.000000
      75%    347.500000  180.000000  250.000000
      max    400.000000  200.000000  300.000000

In [20]:
df.groupby('company').describe().transpose()['GOOG']

sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64